/*!
 * Translated default messages for the jQuery validation plugin.
 * Locale: HE (Hebrew; עברית)
 */
(function ($) {
	$.extend($.validator.messages, {
		required: ".השדה הזה הינו שדה חובה",
		remote: "נ�? לתקן שדה זה.",
		email: "נ�? למל�? כתובת דו�?\"ל חוקית",
		url: "נ�? למל�? כתובת �?ינטרנט חוקית.",
		date: "נ�? למל�? ת�?ריך חוקי",
		dateISO: "נ�? למל�? ת�?ריך חוקי (ISO).",
		number: "נ�? למל�? מספר.",
		digits: ".נ�? למל�? רק מספרי�?",
		creditcard: "נ�? למל�? מספר כרטיס �?שר�?י חוקי.",
		equalTo: "נ�? למל�? �?ת �?ותו ערך שוב.",
		accept: "נ�? למל�? ערך ע�? סיומת חוקית.",
		maxlength: $.validator.format(".נ�? ל�? למל�? יותר מ- {0} תווי�?"),
		minlength: $.validator.format("נ�? למל�? לפחות {0} תווי�?."),
		rangelength: $.validator.format("נ�? למל�? ערך בין {0} ל- {1} תווי�?."),
		range: $.validator.format("נ�? למל�? ערך בין {0} ל- {1}."),
		max: $.validator.format("נ�? למל�? ערך קטן �?ו שווה ל- {0}."),
		min: $.validator.format("נ�? למל�? ערך גדול �?ו שווה ל- {0}.")
	});
}(jQuery));