/*!
 * Translated default messages for the jQuery validation plugin.
 * Locale: FA (Persian; �?ارسی)
 */
(function ($) {
	$.extend($.validator.messages, {
       required: "تکمیل این �?یلد اجباری است.",
       remote: "لط�?ا این �?یلد را تصحیح کنید.",
       email: ".لط�?ا یک ایمیل صحیح وارد کنید",
       url: "لط�?ا آدرس صحیح وارد کنید.",
       date: "لط�?ا یک تاریخ صحیح وارد کنید",
       dateISO: "لط�?ا تاریخ صحیح وارد کنید (ISO).",
       number: "لط�?ا عدد صحیح وارد کنید.",
       digits: "لط�?ا تنها رقم وارد کنید",
       creditcard: "لط�?ا کریدیت کارت صحیح وارد کنید.",
       equalTo: "لط�?ا مقدار برابری وارد کنید",
       accept: "لط�?ا مقداری وارد کنید که ",
       maxlength: $.validator.format("لط�?ا بیشتر از {0} حر�? وارد نکنید."),
       minlength: $.validator.format("لط�?ا کمتر از {0} حر�? وارد نکنید."),
       rangelength: $.validator.format("لط�?ا مقداری بین {0} تا {1} حر�? وارد کنید."),
       range: $.validator.format("لط�?ا مقداری بین {0} تا {1} حر�? وارد کنید."),
       max: $.validator.format("لط�?ا مقداری کمتر از {0} حر�? وارد کنید."),
       min: $.validator.format("لط�?ا مقداری بیشتر از {0} حر�? وارد کنید.")
	}); 
}(jQuery));